Revit 2027 API
FieldValues(IList<VectorAtPoint>) Constructor
 Creates object from an array of domain point vectors
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldValues(
	IList<VectorAtPoint> vectorAtPoint
)
Public Sub New (
	vectorAtPoint As IList(Of VectorAtPoint)
)
public:
FieldValues(
	IList<VectorAtPoint^>^ vectorAtPoint
)
new :
        vectorAtPoint : IList<VectorAtPoint> -> FieldValues
Parameters
vectorAtPoint IList<VectorAtPoint>
 Array of vectors, each corresponding to a domain point
Exceptions
Exception | Condition
ArgumentException |  Members of vectorAtPoint contain different numbers of measurements
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace